# GetCableTraySettings Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CableTraySettings..::..GetCableTraySettings Method
CableTraySettings Class See Also
---
Gets the cable tray settings of the project.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public static CableTraySettings GetCableTraySettings(
	Document document
)
```

Visual Basic
---
```text
Public Shared Function GetCableTraySettings ( _
	document As Document _
) As CableTraySettings
```

Visual C++
---
```text
public:
static CableTraySettings^ GetCableTraySettings(
	Document^ document
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document The document.
# ### Return Value
The cable tray settings of the project.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
CableTraySettings Class
Autodesk.Revit.DB.Electrical Namespace